Revit 2027 API
BuiltInFailures.CopyPasteFailures.CannotCopyNoAttachedParentWarn Property
 Attached Detail Group can't be copied without its Model Group
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCopyNoAttachedParentWarn { get; }
Public Shared ReadOnly Property CannotCopyNoAttachedParentWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCopyNoAttachedParentWarn {
	FailureDefinitionId^ get ();
}
static member CannotCopyNoAttachedParentWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace